pub fn get_key_to_bce(x: &str) -> Option<&str> {
    let k = [
        ("a", "빵"),
        ("b", "뽷"),
        ("c", "삫"),
        ("d", "뺗"),
        ("e", "빽"),
        ("f", "뻭"),
        ("g", "뺶"),
        ("h", "뺗"),
        ("i", "켓"),
        ("j", "캣"),
        ("k", "컛"),
        ("l", "콋"),
        ("m", "켔"),
        ("n", "콌"),
        ("o", "컜"),
        ("p", "뽕"),
        ("q", "뿡"),
        ("r", "뿅"),
        ("s", "뺭"),
        ("t", "뺑"),
        ("u", "쁑"),
        ("v", "뺭"),
        ("w", "삉"),
        ("x", "쀵"),
        ("y", "뽱"),
        ("z", "뼝"),
    ];
    for i in k.iter() {
        if i.0 == x {
            return Option::Some(i.1);
        }
    }
    None
}


pub fn get_key_to_str(x: &str) -> Option<&str> {
    let k = [
        ("빵", "a"),
        ("뽷", "b"),
        ("삫", "c"),
        ("뺗", "d"),
        ("빽", "e"),
        ("뻭", "f"),
        ("뺶", "g"),
        ("뺗", "h"),
        ("켓", "i"),
        ("캣", "j"),
        ("컛", "k"),
        ("콋", "l"),
        ("켔", "m"),
        ("콌", "n"),
        ("컜", "o"),
        ("뽕", "p"),
        ("뿡", "q"),
        ("뿅", "r"),
        ("뺭", "s"),
        ("뺑", "t"),
        ("쁑", "y"),
        ("뺭", "v"),
        ("삉", "w"),
        ("쀵", "x"),
        ("뽱", "y"),
        ("뼝", "z"),
    ];
    for i in k.iter() {
        if i.0 == x {
            return Option::Some(i.1);
        }
    }
    None
}
